<HTML>
<HEAD><TITLE>Im&aacute;genes en HTML</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF">

<center>
<table width=700 cellpadding=3 cellspacing=3>
<tr><td>

<font size=3 face="Arial">

<table cellpadding=3 cellspacing=3>
<tr>
<td><img src="careta.gif" alt="Icono" width=54 height=87></td>
<td><font  size=6><b>Im&aacute;genes en HTML</b></font></td>
</tr>
</table>

<p>
Es sabido por todos, que en un documento HTML, pueden incluirse tanto texto como im&aacute;genes, o incluso como ve&iacute;amos en la parte de hiperenlaces pueden actuar como hiperenlace a otro documento.
</p>

<p>
En Internet b&aacute;sicamente se trabaja con 2 formatos de imagen, que son el formato <b>.JPG</b> y el <b>.GIF</b> (aunque &uacute;ltimamente y debido a problemas de copyright y de derechos de autor de la compresi&oacute;n empleada por el formato GIF, entra tambi&eacute;n a formar parte del universo imagin&iacute;stico el nuevo formato <b>.PNG</b>).
</p>

<p>
Tambi&eacute;n pueden emplear otros formatos de im&aacute;genes, pero el hacerlo, presupone que muchos de nuestros visitantes tengan un navegador que reconozca dicho formato que deseamos emplear, o el plug-in adecuado para que sea reconocida omo imagen en formato distinto a los anteriormente enunciados (hasta la fecha, se reconocen como universles, en todos los navegadores, los formatos .GIF y .JPG y los m&aacute;s modernos soportan ya .PNG). El poner im&aacute;genes no soportadas en modo est&aacute;ndar por la mayor&iacute;a de los navegadores, hace que nuestros usuarios hayan de instalar el pulg-in coreespondiente, muchos de los cuales no estar&aacute;n dispuestos a hacerlo, perdiendo “clientela” que visite nuestra p&aacute;gina.
</p>
<br>

<font  size=5><b>GIF</b></font>

<p>
GIF es un formato inventado por Unisys, la cual a empezado a cobrar por el algoritmo de compresi&oacute;n a las compañ&iacute;as comerciales, por lo que se invent&oacute; el formato .PNG, mejor que el .GIF y totalmente gratuito, aunque hasta la fecha, como a los usuarios de a pie no se nos cobra por el uso del GIF, se sigue empleando ampliamente en Internet por el p&uacute;blico en general.
</p>

<p>
GIF es un formato que no soporta imagen de m&aacute;s de 256 colores, lo que lo hace ideal para logotipos e im&aacute;genes con no demasiado colorido. GIF adem&aacute;s permite realizar las operaciones especiales, indicadas a continuaci&oacute;n:
</p>

<ul>
<li>Permite crear fondos transparentes, lo que permite sustituir uno de los colores por una m&aacute;scara especial que hace que se muestre el fondo sobre el que se apoya la imagen. A este formato de imagen transparente se le conoce como <b>GIF89a no entrelazado</b>.

<p>
<b>NOTA: el formato normal GIF, sin reconocimiento de transparencia de fondo, se le conoce como GIF87.</b>
</p>
<br>

<li>Permite crear animaciones dentro de una imagen de forma que varias im&aacute;genes se comprimen en el mismo archivo .GIF, y al ser visualizado por el navegador, muestran la pequeña animaci&oacute;n que encierra la imagen. Esto tambi&eacute;n est&aacute; incluido en las caracter&iacute;sticas del formato <b>GIF89a</b>.<br><br>

<li>Permite tambi&eacute;n por otra parte crear un efecto de difusionado de la imagen, que conforme se va cargando en nuestro navegador, va mostrando la imagen m&aacute;s nitidamente, hasta alcanzar la resoluci&oacute;n total de la misma, de forma que hasta que no est&eacute; cargada en su totalidad, nos da una idea de la misma, sin tener que esperar a que toda ella sea cargada. Este formato es el denominado <b>GIF89a entrelazado</b>.

<p>
<b>NOTA: Para manipulado de las im&aacute;genes GIF para su uso en Internet (transparencia, animaci&oacute;n y difuminado), se emplean programas de dominio p&uacute;blico (shareware) que se hayan en Internet:</b>
</p>
<center>
<table cellpadding=3 cellspacing=3>
<tr>
<td><b>Transparencia (PC)</b></td>
<td><b><font  size=4>Lview Pro</font></b></td>
</tr>

<tr>
<td><b>Gif animado (PC)</b></td>
<td><b><font  size=4>Gif Construction Set</font></b></td>
</tr>

<tr>
<td><b>Difuminado (PC)</b></td>
<td><b><font  size=4>Paint Shop Pro</font></b></td>
</tr>
</table>
</center>
</ul>
<br>


<font  size=5><b>JPEG</b></font>

<p>
JPEG es un formato de almacenamiento de im&aacute;genes; es de dominio p&uacute;blico, as&iacute; como su algoritmo de encriptaci&oacute;n y compresi&oacute;n. La ventaja de este aspecto con respecto al GIF87 (es decir GIF normal de todo sin ning&uacute;n tipo de efecto), es que mientras que el GIF87 s&oacute;lo permite hasta un m&aacute;ximo de 256 colores (8 bits), JPG permite hasta un m&aacute;ximo de 16 millones de colores (24 bits), lo que la hace ideal para el almacenamiento de fotograf&iacute;as escaneadas, ya que su algoritmo de compresi&oacute;n supera conmucho a otros formatos de 24 bits, como puede ser .BMP.
</p>

<p>
El formato .JPG al igual que el GIF89a, tambi&eacute;n permite el disuminado progresivo de la imagen, mediante el formato JPEG entrelazado, pero no as&iacute; las animaciones ni las trasparencias que permit&iacute;a el GIF89a.
</p>
<br>

<font  size=5><b>GIF o JPEG</b></font>

<p>
Esta es la duda de muchos usuarios. Mi consejo es que emplees el formato GIF para im&aacute;genes que no tengan m&aacute;s de 16 colores a 256 (ya sean fondos, iconos, barras, ...), y el formato JPEG para im&aacute;genes de entre 256 y 16 millones de colores.
</p>

<p>
Despu&eacute;s, si lo que quieres es dasr una mayor vistosidad a tus p&aacute;ginas con im&aacute;genes transparentes o pequeñas animaciones, la opci&oacute;n es clara, GIF89a (que no debemos de olvidar que tampoco soporta im&aacute;genes de m&aacute;s de 256 colores).
</p>

<p>
Otra buena opci&oacute;n, es la de almacenar las miniauras en formato GIF, y las im&aacute;genes grandes de estas im&aacute;genes, con mayor calidad y resoluci&oacute;n, en formato JPEG.
</p>
<br>

<font  size=5><b>IMAGENES EN HTML</b></font>

<p>
La inclusi&oacute;n de im&aacute;genes en un documento HTML precisa de la directiva abierta <b>&lt;IMG&gt;</b> (image). Hace uso de varios atributos, el m&aacute;s importante y fundamental SRC que sirve para indicar la direcci&oacute;n en la que se encuentra la imagen que se est&aacute; empleando. Soporta cualquier tipo de imagen, pero no debemos de olvidar que la soporta el atributo, pero no as&iacute; todos los navegadores. Es decir, podemos poner cualquier formato pero esto no supone que en el navegador se visualice. Ya hemos dicho que los formatos reconocidos universalmente por todos los navegadores es .GIF y .JPG.
<p>

&lt;IMG SRC=“ruta_de_imagen/imagen.gif o imagen.jpg”&gt;

<p>
Al igual que con los hiperenlaces, podemos hacer referencias absolutas o relativas a las im&aacute;genes (Ver hiperenlaces).
</p>

&lt;IMG SRC=“icono.gif”&gt;

<p>
mostrar&iacute;a la imagen “icono.gif” que se halla en el mismo directorio que el documento .html actual.
</p>

&lt;IMG SRC=“iconos/icono.gif”&gt;

<p>
muestra la imagen icono.gif que se halla en un directorio llamado “iconos” que se halla en el mismo directorio que el documento .html actual.
</p>

&lt;IMG SRC=“http://lucas.cdf.udc.es/jgorriz/icono.jpg”&gt;

<p>
muestra la imagen “icono.jpg” que se halla en la URL del servidor “lucas.cdf.udc.es” en el directorio “jgorriz” del mismo.
</p>

<p>
La directiva &lt;IMG&gt; posee varios atributos como son:
</p>

<ul>
<li><b>SRC=“imagen”</b>

<p>
Indica el nombre del fichero gr&aacute;fico a mostrar (GIF o JPEG en principio que es el reconocido universalmente por todos los navegadores), ya visto anteriormente.
</p>

<li><b>ALT=“texto”</b>

<p>
Muestra un texto alternativo a la imagen que mostramos para las personas que no tengan navegadores gr&aacute;ficos o empleen un navegador en modo texto como puede ser el Lynx. Tambi&eacute;n es bueno ponerlo en general, ya que muchos de los usuarios, desactivan la opci&oacute;n de ver im&aacute;genes en el navegador, y este texto alternativo a la imagen les har&aacute; tener una idea de la imagen a la que el texto sustituye.
</p>

<li><b>ALIGN=“TOP | MIDDLE | BOTTOM”</b>

<p>
Indica como se ha de alinear el texto que siga o preceda a la imagen que mostremos. TOP coloca el comienzo de texto en la parte superior de la imagen, MIDDLE a la altura de la parte central de la misma y BOTTOM alinea el texto en el pie de imagen. Por defecto la alineaci&oacute;n var&iacute;a con el tipo de navegador empleado.
</p>

<li><b>BORDER=“tamaño num&eacute;rico”</b>

<p>
Indica un valor num&eacute;rico para el borde de una imagen que se visualiza como un marco alrededor de la misma en la pantalla del navegador: Cuando dicha imagen act&uacute;e como hiperenlace, si ponemos BORDER=0, no se ver&aacute; dicho borde, y s&oacute;lo se sabe que es imagen con hiperenlace si pasamos el rat&oacute;n por encima de la misma, y el puntero cambia de forma a una mano con el dedo &iacute;ndice, indicativa de que es hiperenlace. Por defecto y la imagen no es enlace, es 0, pero si act&uacute;a como enlace el valor por defecto es 1.
</p>

<li><b>HEIGHT=“tamaño num&eacute;rico”</b>

<p>
Indica el alto de la imagen en puntos (pixels) o en porcentaje. Se emplea para variar el tamaño de la imagen original, as&iacute; como para indicar al navegador el tamaño de pantalla que debe de reservar para dicho gr&aacute;ficoen altura.
</p>

<li><b>WIDTH=“tamaño num&eacute;rico”</b>

<p>
Indica el ancho de la imagen en puntos (pixels) o en porcentaje. Se emplea para variar el tamaño de la imagen original, as&iacute; como para indicar al navegador el tamaño de pantalla que debe de reservar para dicho gr&aacute;fico en anchura.
</p>

<p>
<b>TRUCO:</b> Un truco para que nuestra p&aacute;gina cargue antes las im&aacute;genes, es indicar al navegador con estos 2 &uacute;ltimos atributos el tamaño en ancho y alto real de la imagen, de forma que el navegador les asigne su espacio real a la hora de visualizarlos, y mientras las va cargando, cargue tambi&eacute;n el resto del documento HTML. De no hacerlo as&iacute;, el navegador no sabr&aacute; exactamente el tamaño de la imagen real, y la ir&aacute; cargando; mientras no finalice su carga, como no sabe el tamaño real que ocupar&aacute; la imagen (ya que no se o hemos indicado con los atributos correspondientes), no seguir&aacute; bajando el resto de la p&aacute;gina, hasta que finalice de bajar las im&aacute;genes, lo que retarda la carga de la p&aacute;gina HTML completa con texto y gr&aacute;ficos.
</p>

<li><b>HSPACE=“valor de margen”</b>

<p>
Indica un margen horizontal que debe existir entre la imagen y el texto que lo circunde (si lo hubiera). Este valor separa, tanto al texto que precede como al que sigue a la imagen.
</p>

<li><b>VSPACE=“valor de margen”</b>

<p>
Al igual que el anterio, pero para m&aacute;rgenes verticales de la imagen.
</p>

<p>
<b>TRUCO:</b> Hay una forma muy sencilla de crear “espacio vac&iacute;o” en nuestras p&aacute;ginas, lo que puede resultar muy conveniente de cara a construir m&aacute;rgenes o crear determinados efectos en a pantalla. Podemos hacerlos de 2 formas: con WIDTH y HEIGHT definimos el espacio que debe de ocupar la imagen. Si &eacute;sta es transparente o de un s&oacute;lo color, el efecto ser&aacute; el de un cuadro vac&iacute;o o s&oacute;lido, seg&uacute;n nuestras necesidades; con HSPACE y VSPACE no cambia el tamaño de la imagen, con lo que podemos definir un gran espacio para ela y visualizarla o no, si optamos por hacer un fondo transparente.
</p>
</ul>
</font>

</td></tr>
</table>
</center>

<center>
<table cellpadding=3 cellspacing=3>
<tr>
<td><a href="manual04.htm">
<img src="2ant.gif" alt="Anterior" width=32 height=31 border=0></a></td>

<td><a href="index.htm">
<img src="puzzle.gif" alt="Menu" width=90 height=75 border=0></a></td>

<td><a href="manual06.htm">
<img src="2sigui.gif" alt="Anterior" width=32 height=31 border=0></a></td>
</tr>
</table>
</center>

</BODY>
</HTML>