<HTML>
<HEAD><TITLE>Consejos Generales sobre HTML</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF">
<br><br>

<center>
<table cellpadding=3 cellspacing=3 width=700>
<tr><td>
<font size=3 face="Arial">

<center><u><b> NOTA</b></u></center>

<p>
<b>
Ante todo quiero dejar claro, que pese a que estos consejos son todos ellos de gran utilidad, y debido a las preferencias personales del diseñador, dejo claro desde un principio que el primero en amoldarme a las que m&aacute;s correctas me parecen, soy yo; sin embargo otros de los muchos consejos que doy, no son seguidos por mi persona al pie dela letra.... :-)
</b>
</p>

<center>
<table cellpadding=3 cellspacing=3>
<tr>
<td><img src="salvavid.gif" alt="Icono" width=65 height=43> </td>
<td><font  size=6><b>Consejos Generales sobre HTML</b></font></td>
</tr>
</table>
</center>

<ul>

<li>Mant&eacute;n el interes de los usuarios. El contenido puede ser entretenido o atractivo pero sobre todo ha de ser &uacute;til.<br><br>

<li>Dar cierto grado de iteraci&oacute;n a las p&aacute;ginas no es tampoco una mala idea, por ejemplo permitiendo la subscripci&oacute;n a alg&uacute;n tipo de servicio (revista, lista de correo, ...). Tambi&eacute;n es de ayuda emplear alg&uacute;n medio para premiar la fidelidad del usuario, como por ejemplo la posibilidad de recuperar software o documentaci&oacute;n libremente.<br><br>

<li>Diseñar una estructura s&oacute;lida y flexiblede la informaci&oacute;n y respetarla escrupulosamente. Las improvisaciones “sobre la marcha”, sin planificaci&oacute;n, acaban propiciando una enorme anarqu&iacute;a organizativa cuado crece el volumen de datos.<br><br>

<li>No incluyas materiales ni p&aacute;ginas de relleno. Haz que cada p&aacute;gina contenga algo de valor. Las velocidades de tranmisi&oacute;n son lo suficientemente lentas como para premiar al usuario que tiene paciencia para esperar a que se cargue una p&aacute;gina. Si crees que la estructura exige p&aacute;ginas de tr&aacute;mite cambia esa estructura.<br><br>

<li>Emplea alternativas. Tu cliente puede emplear un navegador no gr&aacute;fico, o emplear una l&iacute;nea lenta y desactivar la carga de im&aacute;genes, o la transferencia de &eacute;stas verse afectada por errores y problemas de la comunicaci&oacute;n. Esto supone en primer lugar ser especialmente cuidadoso con las directivas HTML (uso del par&aacute;metro ALT de IMG), pero deber&iacute;as considerar acciones de m&aacute;s calado; mantener una versi&oacute;n s&oacute;lo texto, o incluso una especial para usuarios que accedan  con una l&iacute;nea lenta (menos gr&aacute;ficos y de menor tamaño).<br><br>

<li>Si vas a emplear frames (cuadros), sopesa la posibilidad de incluir una versi&oacute;n sin frames. A muchos usuarios les molesta la forma de presentar as&iacute; la informaci&oacute;n. Adem&aacute;s en diversas plataformas hardware (por ejemplo PC, sin demasiada resoluci&oacute;n gr&aacute;fica), los frames ocupan un espacio precioso en la pantalla.<br><br>

Tambi&eacute;n debes considerar los inconvenientes del uso de frames, en concreto la imposibilidad de crear un bookmark adecuado.<br><br>

<li>Sopesa cuidadosamente la posiblidad de hacer un espacio Web muy general o que est&eacute; orientado a ser visualizado &uacute;nicamente por un nevegador o un conjunto limitado a &eacute;stos. Suele ser preferible sacrificar funcionalidades especiales para ceñirse al est&aacute;ndar, aunque tampoco hay que ir demasiado lejos: evita en la medida de lo posible el uso de elementos exclusivos de una versi&oacute;n de un visualizador, sobre todo si la versi&oacute;n no es la &uacute;ltima y los elementos no han tenido continuidad.<br><br>

Advierte siempre cual es la mejor forma de visualizar tus p&aacute;ginas, incluyendo si es posible, enlaces a los distintos sitios en los que pueda conseguir el software adecuado para la ocasi&oacute;n (esto es esencial en el caso de que emplees plug-ins o similares).<br><br>

<li>Es muy conveniente incluir datos sobre fechas de creaci&oacute;n y actualizaci&oacute;n y versiones (si es necesario y relevante). Indica la &uacute;ltima fecha en la que se incorpor&oacute; o actualiz&oacute; la informaci&oacute;n es de gran utilidad para los usuarios, especialmente para los habituales.<br><br>

<li>“No pulse aqu&iacute;”. Causa un enorme rechazo el uso de enlaces identificados por el texto “pulse aqu&iacute;” o simplemente “aqu&iacute;” (sindrome del “click here“ es el nombre que le dan algunos). Suele ser motivo autom&aacute;tico de inclusi&oacute;n en las listas del tipo “This is The Worst” (Esta es La Peor). En realidad se trata de algo m&aacute;s que un capricho, este tipo de textos no añade ninguna informaci&oacute;n de utilidad mientras que explicar un enlace conuna pequeña indicaci&oacute;n de lo que va a encontrar el usuario cuando lo active es una forma m&aacute;s apropiada de actuar.<br><br>

<li>Mide el tamaño de texto que sirve como enlace y su significado. No debe de ser ni demasiado largo ni demasiado corto y debe expresar una cierta idea clara que permita al usuario intuir qu&eacute; es lo que puede esperar si lo sigue. Una bena aproximaci&oacute;n es hacer que haya una relaci&oacute;n clara (cuando eso sea posible), entre el texto del enlace y el &uacute;ltimo de la p&aacute;gina a la que hace referencia.<br><br>

<li>Respeta las convenciones sobre el color de los enlaces. Cambiarlas s&oacute;lo confundir&iacute;a a los usuarios (por lo menos a los m&aacute;s novatos). Como regla pr&aacute;ctica no modifiques estos, a menos que el fondo de tus p&aacute;ginas las haga ilegibles.<br><br>

<li>En las listas de enlaces trata de resaltar aquello que diferencia a un elemento de otro en vez de marcar el texto de cada entrada. Evita saturar al usuario y ser repetitivo.<br><br>

<li>No hagas p&aacute;ginas demasiado largas. Los usuarios tieneden a ver en el final de la ventana el de la propia p&aacute;gina. Adem&aacute;s, la fortuna de recorrer documentos en el WWW juega en contra de la lectura pausada y exhaustiva.<br><br>

Las p&aacute;ginas cortas facilitar&aacute;n adem&aacute;s las tareas de mantenimiento.<br><br>

<li>Advierte suficientemente al usuario si se va a enfrentar a un documento largo, es posible que prefiera salvarlo o imprimirlo para continuar la lectura m&aacute;s tarde. En estos casos es muy conveniente incluir un resumen de los contenidos del ducomento para ahorrar al usuario, dedicar tiempo a examinar una informaciñon que quiz&aacute;s no tenga interes para &eacute;l. Tambi&eacute;n puede ser de ayuda duplicar los botones o comandos de navegaci&oacute;n añadi&eacute;ndolos al final de cada documento.<br><br>

<li>Si la documentaci&oacute;n que exporta est&aacute; muy fragmentada, al usuario le resultaria muy interesante disponer de alguna versi&oacute;n en un s&oacute;lo fichero que le facilite la impresi&oacute;n. Este fichero no tiene por qu&eacute; ser formato estandar HTML, es v&aacute;lido cualquier otro como texto plano o Postcript (que est&aacute; directamente orientado a la impresi&oacute;n).<br><br>

<li>A menos que est&eacute; visualizando una serie de documentos claramente ordenados y en los que la navegaci&oacute;n debiera dicurrir por un camino prefijado, evite emplear enlaces del tipo “anterior”, “siguiente”, “inicio” o “fin”. Es preferible que todos sus enlaces tengan direcciones absolutas y no relativas ya que el proceso de navegaci&oacute;n es impredecible y ya cuenta con funciones efectivas en el propio navegador.<br><br>

<li>Ten mucho cuidado con los iconos que emplees para navegar. Su significado debe ser suficientemente claro para el usuario que est&eacute; acostumbrado a distintas presentaciones. Es conveniente dejar un poco de lado la creatividad y la inventiva en estos casos y ser m&aacute;s convencional. Emplea mecanismos redundantes para apoyar el significado de los iconos de navegaci&oacute;n; enlaces con etiquetas textos o fragmentos de c&oacute;digo Javascript para informar al usuario.<br><br>

<li>No “agotes” la tecnolog&iacute;a. Evita incorporar el &uacute;ltimo componente interactivo, el plug-in m&aacute;s reciente, las directivas exclusivas de la versi&oacute;n beta de un nuevo visualizador. Tus usuarios ir&aacute;n m&aacute;s despacio (por ejemplo, aunque mñas del 70% utiliza Netscape, s&oacute;lo una fracci&oacute;n emplean la versi&oacute;n 4.0 o posteriores), y deber&iacute;as darles tiempo a alcanzarle. Fiar el n&uacute;cleo de un Web a una tecnolog&iacute;a aparecida recientemente hace que los usuarios no puedan acceder correctamente y abandonen.<br><br>

En general s&eacute; algo conservador. Prueba las nuevas tecnolog&iacute;as pero espera a que hayan madurado y empiecen a ser familiares para sus visitantes.<br><br>

<li>Olvida las “PAGINAS EN CONSTRUCCION”. No hay nada m&aacute;s frustrante que seguir un enlace que no lleva a ninguna parte. Es mejor que la entrada no tenga enlace a hacer creer al usuario que existe una secci&oacute;n y se encuentre con una p&aacute;gina que s&oacute;lo dice “disculpe, p&aacute;gina en construcci&oacute;n”. Es a&uacute;n peor si contiene gr&aacute;ficos que consumen un tiempo precioso en su carga.<br><br>

<li>No dudes en proteger las secciones que estimes convenientes en tu servidor. Si el esquem “login-password” no te parece suficiente, ponte en contacto con tu WEBMASTER para que te recomiende la forma &uacute;til de proteger las secci&oacute;n que quieras proteger.<br><br>

<li>Una forma de mantener informados a los usuarios sobre el grado de actualizaci&oacute;n de los contenidos es mantener una p&aacute;gina de Novedades. Esto, adem&aacute;s de un gesto de cortes&iacute;a en Internet, es un servicio de valor añadido para los usuarios. Ordenadas cronol&oacute;gicamente, y con enlaces a las p&aacute;ginas implicadas, cada entrada es las novedades contendr&aacute; una pequeña descripci&oacute;n de los cambios y su amplitud.<br><br>

<li>Como complemento de la p&aacute;gina de Novedades (o p&aacute;ginas si se quieren fragmentar y sectorizar) se puede incluit la suscripci&oacute;n (y la anulaci&oacute;n de la suscripci&oacute;n, claro) a una lista de correo que informe puntualmente de los cambios en el contenido del servidor o de alguna de sus secciones.<br><br>

<li>Considera la inclusi&oacute;n de un sistema de b&uacute;squeda. Puedeconsistir en una utilidad basada en el uso de formularios (hay varias disponibles en la red que pueden emplearse libremente), o en un simple &iacute;ndice de contenidos con enlaces a las p&aacute;ginas adecuadas. En cualquier caso, ser&aacute; una herramienta de gran utilidad para los usuarios que tengan dificultades para hallar informaci&oacute;n concreta en tus p&aacute;ginas.<br><br>

<li>Incluye alguna secci&oacute;n dedicada a indicar el prop&oacute;sito y contenido de tu espacio Web. Abundan en Internet servidores que exportan gran cantidad de informaci&oacute;n pero en los que es preciso dedicar tiempo a navegar y bucear en ellos hasta averiguar cua´l es su prop&oacute;sito, y qu&eacute; tipo de informaci&oacute;n contienen.<br><br>

<li>No satures tus p&aacute;ginas con muchas im&aacute;genes, cada una supone una carga independiente y en algunos navegadores, sobre todo si tienen una conexi&oacute;n lenta, puede ser un suplicio que invita a saltar a otro punto de la red. Toma nota de los “cl&aacute;sicos” que en la mayor&iacute;a de los casos optan por la sencillez.<br><br>

<li>No pongas textura de fondos en tus p&aacute;ginas con colores muy chillones ya qe har&aacute;n pr&aacute;cticamente ilegibles los textos. Tampoco es recomendable colocar de fondo una imagen superior a 5 Kb de tamaño, ya que relentizar&iacute;a mucho el proceso de carga y nuestro visitante opte por abandonar nuestra direcci&oacute;n por exceso de tiempo de carga.<br><br>

<li>Conviene poner comentarios en los documentos, ya que puede que mucha gente est&eacute; interesada en ver la estructura de &eacute;stos para aprender m&aacute;s de la forma que tenemos de diseñar la p&aacute;gina. Los comentarios ser&aacute;n una ayuda para todos aquellos que sigan esta t&eacute;cnica, y es muy de agradecer a la hora de modificar nuestra propia p&aacute;gina sin estar buscando durante un rato el trozo de c&oacute;digo que deseamos modificar.<br><br>

<li>Sencillez no es pobreza. Tampoco dejes tus p&aacute;ginas desangeladas y faltas de atractivos. Ten en cuenta que “tienen que entrar por los ojos” a menos que su contenido tenga una enorme importancia para sus lectores.<br><br>

<li>Otro error muy com&uacute;n es emplear im&aacute;genes complejas, grandes y densas, que requieren un enorme esfuerzo de carga que acaba aburriendo al usuario m&aacute;s curtido. Provee siempre de miniaturas si es que quieres exportar gr&aacute;ficos complejos, no emplees densidades de im&aacute;genes desmesuradas (ten en cuenta que la calidad gr&aacute;fica de la mayor&iacute;a de los equipos es m&aacute;s bien limitada), ni paletas saturadas de colores (muchos PC s&oacute;lo soportan 16, o 256 colores como m&aacute;ximo).<br><br>

Existen utilidades que reducen el tamaño de las im&aacute;genes sin degradar su aspecto (utilizan menos bits para el color). &uacute;salas siempre que sea posible, no e consiguen mejoras espectaculares pero tus usuarios te lo agradecer&aacute;n.<br><br>

<li>Incluye el tamaño de las im&aacute;genes en las entradas IMG (atributos width y height). Aceleran  la carga de las p&aacute;ginas al permitir al navegador reservar el espacio necesario para el gr&aacute;fico en vez de esperar que &eacute;ste sea cargado. Siel navegador no interpreta estas directivas o atributos, no pasa nada, ya que los tags HTML que un navegador no soporta, simplemente los ignora.<br><br>

<li>Siempre que sea posible, haz empleo de los sistemas  de im&aacute;genes GIF y JPEG “entrelazadas” (interlaced). Muestran el contenido de una imagen mientras est&aacute; cargando, por lo que el usuario puede tomar decisiones sin necesidad de esperar a que finalice el proceso de obtenci&oacute;n de la p&aacute;gina y sus componentes.<br><br>

<li>Otra forma de ganar tiempo es el emplear el atributo LOWSRC que permite importar en primer lugar una imagen pequeña con poca definici&oacute;n antes de la definici&oacute;n definitiva. Este sistema se puede utilizar para mostrar mensajes e im&aacute;genes con distinto significado, no s&oacute;lo la versi&oacute;n reducida de la imagen final.<br><br>

<li>Indica claramente cual es el objeto de un mapa interactivo. Si no se puede extraer directamente de la propia imagen, esta informaci&oacute;n deber&iacute;a de estar f&aacute;cilmente accesible al usuario. Tambie&eacute;n es conveniente indicar qu&eacute; &aacute;reas est&aacute;n activas en la imagen (la soluci&oacute;n de simular o delimitar secciones de la imagen es muy adecuada).<br><br>

<li>Por supuesto, no olvides ofrecer alternativas al empleo del mapa. En primer lugar utiliza un texto para el caso de que la imagen no se cargue. En segundo lugar, provee una lista de entradas que realicen las mismas funciones que el mapa.<br><br>

<li>Emplea mapas locales en lugar de mapas en forma servidor, ya que en modo local, los contenidos de las &aacute;reas que definen el mapa, se cargan con la propia p&aacute;gina web, mientras que en modo servidor, tu p&aacute;gina de be de hacer una llamada al ordenador donde est&eacute; alojada y pedir los contenidos de las &aacute;reas del mapa, ralentizanto el proceso de carga.<br><br>

<li>No est&aacute; de m&aacute;s que incluyas referencias sobre el autor de la p&aacute;gina, o al menos de las m&aacute;s relevantes, pero tampoco hay que extenderse. Lo mejor es incluir un enlace a las p&aacute;ginas personales del autor antes que repetir una y otra vez la misma informaci&oacute;n.<br><br>

<li>Una de las reglas no escritas en Internet es la de destacar y respetar la individualidad y la personalidad en un medio que puede disolverse f&aacute;cilmante la identidad personal.<br><br>

<li>En general, no est&aacute; de m&aacute;s incluir alguna p&aacute;gina dedicada a resumir cuestiones de cr&eacute;ditos y Copyright. Es un buen complemento de las p&aacute;gina personales de los articipantes en el desarrollo.<br><br>

<li>Si la p&aacute;gina que estamos diseñando queremos que tenga &eacute;xito, debemos pensar en diseñarla para el mayor n&uacute;mero de visitantes posible. El idioma no oficial de la Red, es de todos sabido que es el ingles, por lo que si queremos que adem&aacute;s de los hispanohablantes nos lean tambi&eacute;n los de habla inglesa, debemos de diseñar en la medida de lo posible la misma p&aacute;gina con opci&oacute;n inglesa.<br><br>

<li>Agradecimientos. Una excelente pr&aacute;ctica, muy en l&iacute;nea con la mejor “tradici&oacute;n Internet”. Siempre hay algo que agradecer: colaboraciones de usuarios, iconos tomados de alg&uacute;n servidor, cesi&oacute;n de materiales, uso de software p&uacute;blico, a mam&aacute; por hacernos el bocadillo del recreo... :-P. Si se incluye un enlace a las p&aacute;ginas relacionadas con cada entrada en los agradecimientos ser&aacute; a&uacute;n mejor.<br><br>

Recuerda que muchos de los servicios gratuitos en la red, esperan como correspondencia el ser incluidos en la p&aacute;gina que prestan el serivicio gratutitamente, con un enlace a su propia p&aacute;gina. Lo mismo se puede decir del software de libre ditribuci&oacute;n; muchos autores se consideran muy bien pagados con un mensaje de correo comentando el uso que se hace de su trabajo, y con un enlace a sus p&aacute;ginas personales.<br><br>

<li>Los comentarios de los usuarios son siempre valiosos e interesantes. Contempla alg&uacute;n mecanismo para recibirlos. Puede ser  un “libro de firmas”, un pequeño formulario o simplemente enlaces del tipo “mailto”. Adem&aacute;s de ser un medio id&oacute;neo para evaluar la aceptaci&oacute;n le resultar&aacute; muy gratificante recibir comentarios personales de gente con nombre y apellidos, no n&uacute;meros en las estad&iacute;sticas de tu servidor.<br><br>

<li>Responde siempre a los comentarios de los usuarios. No les hagas creer que su interes no tiene eco. Ded&iacute;cales tiempo y recursos.<br><br>

<li>No difundas informaci&oacute;n protegida por derechos de autor sin perdir, al menos, el permiso escrito de su autor. Lo mismo se puede decir de los logotipos y marcas. Adem&aacute;s debes de tener mucho cuidado con la procedencia de las im&aacute;genes y segurarte de que su empleo no est&aacute; penada.<br><br>

<li>Respeta la estructura del documento. Emplea las directivas &lt;HTML&gt;, &lt;HEAD&gt;, &lt;BODY&gt;, y no las mezcles pues se producir&iacute;a una situaci&oacute;n que puede dar lugar a errores imprevisibles que dejan una &eacute;dima impresi&oacute;n en el cliente.<br><br>

<li>Pon siempre un t&iacute;tulo. La directiva &lt;TITLE&gt; tiene m&aacute;s utilidad de lo que se piensa. No s&oacute;lo encabeza la visualizaci&oacute;n dela p&aacute;gina, tambi&eacute;n puede dar nombre al icono del navegador cuando se minimiza, y al guardar la direcci&oacute;n del documento como “bookmark” o “hot link” se puede explicar su contenido con este texto.<br><br>

<li>Identifica y firma tus documentos. Esta informaci&oacute;n se puede incluir con las directivas ADDRESS,o cualquier otra forma de visualizar la informaci&oacute;n.<br><br>

<li>No dejes enlaces con espacios. O m&aacute;s exactamente, evita que tras una directiva &lt;A&gt;, aparezca un car&aacute;cter equivalente al espacio en blanco, la igual que al incluir un enlace. Visualmente, los espacio subrayados pertenecientes al enlace son de muy mal efecto. Considera los casos apropiados para emplear estilos f&iacute;sicos o l&oacute;gicos. Normalmente se recomiendan los estilos f&iacute;sicos ya que dan un mayor control sobre la presentaci&oacute;n final del documento.<br><br>

<li>Ten cuidado con el uso que hagas de las cabeceras o headings. El tipo de letra, y sobre todo, el tamaño es muy variable y depende de los gustos del usuario. No emplees letras muy grandes con las cabeceras ya que dependiendo del tipo de navegador puede dar tamaños de letras m&aacute;s grandes del esperado.<br><br>

<li>Evita errores en las directivas. Los navegadores no realizan un comprobaci&oacute;n acerca de la correci&oacute;n del c&oacute;digo HTML que reciben. De esta forma, directivas err&oacute;neas, obsoletas y pertenecienes a extensiones no reconocidas son tratadas por igual, normalmente ignorando su efecto. Este hecho exige ser muy cuidadoso con el c&oacute;digo que se exporta. Adem&aacute;s hay que tener en cuenta que algunos navegadores son m&aacute;s tolerantes que otros y son capaces de “entender” la intenci&oacute;n de algnas directivas err&oacute;neas o incompletas (por ejemplo, añadiendo el cierre o comillas).<br><br>

<li>Es conveniente desactivar las directivas que no se quieran emplear a&uacute;n cuando est&eacute;n dentro de un comentario, ya que hay navegadores que pueden ignorar esta circunstancia.<br><br>

<li>Asegura la validez de los enlaces. Un error muy frecuente es la existencia de URL que apuntan a p&aacute;ginas inexistentes, cuyos servidores han dejado de estar disponibles o han cambiado de direcci&oacute;n,o cuyas direcciones simplemente est&aacute;n mal escritas (por ejemplo la falta de comillas o la mala construcci&oacute;n de la direcci&oacute;n).<br><br>

Estos errores tiene un p&eacute;simo efecto en el cliente para resultar relativamente f&aacute;cil detectarlos y depurarlos. S&oacute;lo se precisa un m&iacute;nimo de atenci&oacute;n y “refrescar” con frecuencia los enlaces visitados.<br><br>

<li>Comprobar peri&oacute;dicamente la existencia y corecci&oacute;n de los enlaces que apuntan a p&aacute;ginas externas. El contenido y direcci&oacute;n de los espacios WEB cambian con rapidez y se puede encontrar que hay p&aacute;ginas que desaparecen y servidores que cambian de direcci&oacute;n.<br><br>

<li>Usa siempre entidades en lugar de acentos. Aunque tu navegador sea capaz de tratar directamente con las vocales acentuadas y otros caracteres especiales hay queusar siempre las entidades normalizadas para curarse en salud.<br><br>

<li>Si quieres que tus p&aacute;ginas sean impresionantes pero que no necesiten bajar m&oacute;dulos ActiveX o Plug-ins, una opci&oacute;n es el empleo de JavaScripts. Lo soportan casi todos los navegadores modernos, y en caso de que alg&uacute;n navegador antiguo no lo soporte no influye para nada en el resto de la p&aacute;gina, siendo ignorados por ellos. Simplemente es c&oacute;digo especial de JavaScript que va embutido en el interior de la p&aacute;gina que se carga autom&aacute;ticamente con &eacute;sta y que antes (normalmente), del final de la carga, pueden empezar a activarse. Los hay de varios tipos, desde los que te muestran la hora, a los que te dejan jugar al tetris, carga aleatoria de fondos... etc y suelen ser de tipo gratuito.<br><br>

<li>No todos tienen el mismo monitor que tu ni trabajan a las mismas resoluciones que lo haces tu, por lo que la p&aacute;gina que has diseñador por ejemplo, en 640x480 puede que no se vea muy bien (excesivamente pequeña) en una resoluci&oacute;n de 1024x768... y viceversa. Procura visualizar tus p&aacute;ginas en todas las resoluciones posibles y ajusta los cambios que creas m&aacute;s convenientes. Eso s&iacute;, diseña siempre a una resoluci&oacute;n de 256 colores como m&aacute;ximo.<br><br>

Por norma, una resoluci&oacute;n de diseño de 800x600 suele ser v&aacute;lida para todo tipo de usuarios que se conectan en la actualidad a Internet, por lo que puede ser una buena opci&oacute;n en trabajar a estas resoluciones.<br><br>

<li>Hay muchas p&aacute;ginas en Internet que poseen un diseño espectacular, sin sacrificar en absoluto la velocidad de carga de la misma. Aprende de ellas mirando su c&oacute;digo una vez cargada la p&aacute;gina completamente. Esto puede enseñarte mucho m&aacute;s que todos los manuales juntos, una vez que màs o menos sepas las distintas directivas existente en el HTML.<br><br>

<li>En caso de que emplees el diseño de tu p&aacute;gina para un navegador en particular, coloca de forma bien visible , el tipo de navegador que se empleo en la construcci&oacute;n del sitio WEB, esto puede dar una idea a nuestros usuarios de los problemas con los que se pueden encontrar en el caso de que no cumplan las exigencias del navegador indicado por nosotros.<br><br>

<li>Disfruta de la creaci&oacute;n de p&aacute;ginas Web tanto como yo, porque todos los d&iacute;as aprender&aacute;s algo nuevo que har&aacute; que no pierdas el interes por el mismo. ...Y recuerda, el l&iacute;mite est&aacute; en tu imaginaci&oacute;n....

</ul>
</font>
</td></tr>
</table>
</center>

<!--
<center>
<table cellpadding=3 cellspacing=3>
<tr>
<td><a href=""><img src="antes.gif" alt="Anterior" width=38 height=32 border=0></a></td>

<td><a href=""><img src="bolsa.gif" alt="Menu" width=70 height=93 border=0></a></td>

<td><a href="mailto:jgorriz@lucas.cdf.udc.es"><img src="mail.gif" alt="Email" width=71 height=59 border=0></a></td>
</tr>
</table>
</center>
-->

<center>
<table cellpadding=3 cellspacing=3>
<tr>
<td><a href="manual16.htm">
<img src="2ant.gif" alt="Anterior" width=32 height=31 border=0></a></td>

<td><a href="index.htm">
<img src="puzzle.gif" alt="Menu" width=90 height=75 border=0></a></td>

<td><a href="manual18.htm">
<img src="2sigui.gif" alt="Anterior" width=32 height=31 border=0></a></td>
</tr>
</table>
</center>

</BODY>
</HTML>