<!--Este documento ha sido generado con XT, de James Clark--><html xmlns:date="http://www.jclark.com/xt/java/java.util.Date"><head><title>Curso de HTML: Gu&iacute;a de estilo</title><META HTTP-EQUIV="pragma" CONTENT="no-cache"></head><!--Cuerpo del documento--><body bgcolor="#FEFEFE"><table width="630" border="0"><tr><td valign="top" align="center" width="40" rowspan="2"><a href="index.html"><img src="graficos/logo.jpg" border="0"></a></td><td align="center" width="590"><IFRAME SRC="http://ad.es.doubleclick.net/adi/ES-programacion.net/ES-redferca-programacion-html;sz=468x60;ord=44126913875755190?" name="frame1" width="468" height="60" frameborder="no" border="0" MARGINWIDTH="0" MARGINHEIGHT="0" SCROLLING="no"><SCRIPT language="JavaScript1.1" SRC="http://ad.es.doubleclick.net/adj/ES-programacion.net/ES-redferca-programacion-html;abr=!ie;sz=468x60;ord=44126913875755190?"></SCRIPT><NOSCRIPT><A HREF="http://ad.es.doubleclick.net/jump/ES-programacion.net/ES-redferca-programacion-html;abr=!ie;sz=468x60;ord=44126913875755190?"><IMG SRC="http://ad.es.doubleclick.net/ad/ES-programacion.net/ES-redferca-programacion-html;abr=!ie;sz=468x60;ord=44126913875755190?" border="0" height="60" width="468"></A></NOSCRIPT></IFRAME></td></tr><tr><td valign="top"><font face="Arial,Helvetica,sans-serif"><font size="+3" color="#005CA0"><b>21. Gu&iacute;a de estilo</b></font>
      <p align="justify">A lo largo de mi deambular por Internet, he ido desarrollando
      peque&ntilde;as man&iacute;as y visto o creido ver defectos en las
      p&aacute;ginas web. Sin embargo, despu&eacute;s de leer un par de cursos
      de HTML y alguna que otra gu&iacute;a de estilo, me he dado cuenta de
      que la mayor&iacute;a de la gente parece pensar como yo.</p>
      <p align="justify">As&iacute; pues, este cap&iacute;tulo consiste en una serie de
      consejos que te pueden servir para hacer tu p&aacute;gina m&aacute;s
      atractiva y de mayor calidad. Es recomendable leerla aunque luego no la
      sigas al pie de la letra: te pueden dar una idea de lo que debe ser una
      web.</p>
    <br><br><a name="1"></a><font size="+2" color="#005CA0">21.1. Contenido</font>
        <p align="justify">Cualquier p&aacute;gina ser&aacute; visitada si su contenido es
        interesante. Casi da lo mismo su estructura y dise&ntilde;o si la
        informaci&oacute;n es lo suficientemente interesante. As&iacute; que
        quiz&aacute; sea conveniente detenernos un poco en qu&eacute; es lo
        que debe tener nuestra p&aacute;gina web.</p>
        <p align="justify">En Internet uno visita lo que quiere, y la mayor&iacute;a de las
        veces lo que a la gente le interesa y lo que a nosotros nos interesa
        que vean no es lo mismo. As&iacute; pues, el mejor modo de conseguir
        que vean lo que queremos es ofrecerles lo que quieren. Un ejemplo
        lo tienes en mi p&aacute;gina personal. En ella pongo cosas que me
        interesa poner a m&iacute; pero que de por s&iacute; s&eacute; que
        no tendr&iacute;an mucha difusi&oacute;n: mis relatos, mis canciones,
        etc... Pero tambi&eacute;n incluyo estos cursos de dise&ntilde;o
        web, que s&eacute; que le interesan a mucha gente.</p>
        <p align="justify">De todas maneras no hay que enga&ntilde;arse: los contenidos que te
        interesa que la gente conozca y que no sean "populares" no ser&aacute;n
        visitados m&aacute;s que por una peque&ntilde;a parte de los interesados
        por los contenidos "populares". Pero siempre lo ser&aacute;n m&aacute;s que
        si no lo hubi&eacute;ramos hecho.</p>
        <p align="justify">El averiguar qu&eacute; poner es f&aacute;cil. Pr&aacute;cticamente
        todo el mundo tiene alg&uacute;n <i>hobby</i>, alguna pasi&oacute;n, o
        domina alg&uacute;n tema bastante por encima de la media. Sobre ese
        tema deber&aacute; estar enfocada su p&aacute;gina. Porque, para qu&eacute;
        enga&ntilde;arnos: a nadie le interesan esas p&aacute;ginas personales
        que s&oacute;lo contienen tres fotos del autor, una de su novia y otra
        de su perro, junto con la historia de su vida y un curriculum y una
        serie de enlaces a p&aacute;ginas de sus amigos.</p>
        <p align="justify">Conviene tambi&eacute;n, sabiendo que el usuario ha acudido a tu
        p&aacute;gina por el inter&eacute;s hacia un tema espec&iacute;fico,
        facilitarle enlaces a p&aacute;ginas similares. Te lo agradecer&aacute;.</p>
      <br><br><a name="2"></a><font size="+2" color="#005CA0">21.2. Navegaci&oacute;n</font>
        <p align="justify">Es muy importante que sea sencilla e intuitiva la navegaci&oacute;n
        por las p&aacute;ginas que componen tu web. Dependiendo del tama&ntilde;o
        de la p&aacute;gina no se deber&iacute;a tardar m&aacute;s de tres toques
        de rat&oacute;n en ir de una p&aacute;gina a otra. Sin embargo, esto no
        se debe conseguir por medio de una saturaci&oacute;n de enlaces porque
        el usuario podr&iacute;a perderse.</p>
        <p align="justify">Hay muchas maneras de conseguirlo. La primera es utilizar un marco
        como &iacute;ndice, que siempre nos permitir&iacute;a acudir a las
        seciones principales en nuestra web. Tambi&eacute;n resulta &uacute;til
        incluir enlaces a la p&aacute;gina principal y a la p&aacute;gina principal
        de la secci&oacute;n que el usuario est&aacute; consultando.</p>
        <p align="justify">En definitiva, no hay receta &uacute;nica, pues el &eacute;xito de
        tu sistema de navegaci&oacute;n depende en buena medida de los contenidos
        y estructura de tu web. Resulta &uacute;til ver a alguien ajeno a su
        desarrollo navegar por ella sin darle ninguna clase de pistas: en general
        se pueden ver con facilidad los mayores problemas que pueda tener.</p>
        <p align="justify">Sin embargo, hay algo que siempre irrita al usuario: enlaces a
        p&aacute;ginas vac&iacute;as o con un gr&aacute;fico que se&ntilde;ale que
        esa p&aacute;gina est&aacute; en construcci&oacute;n. Si te lleva tiempo
        desarrollar una secci&oacute;n pero quieres que los usuarios sepan que
        estar&aacute; ah&iacute; colocala con las dem&aacute;s en la lista de
        enlaces, pero que ella no tenga. Que se vea el nombre aunque no lleve
        a ninguna parte.</p>
      <br><br><a name="3"></a><font size="+2" color="#005CA0">21.3. Estructura de las p&aacute;ginas</font>
        <p align="justify">Es fundamental a la hora de ponerte a crear p&aacute;ginas el pensar
        en una estructura com&uacute;n y consistente, porque facilita la
        navegaci&oacute;n y le confiere personalidad propia. Esa estructura puede
        estar dada por una manera com&uacute;n de titular las secciones, un fondo,
        un logo, una manera com&uacute;n de colocar gr&aacute;ficos y texto, o
        una combinaci&oacute;n de todo esto.</p>
        <p align="justify">Hay que cuidar la longitud de las p&aacute;ginas: que no sean ni
        demasiado cortas ni demasiado largas (como esta). La p&aacute;gina debe
        contener informaci&oacute;n suficiente para resultar interesante y no
        tanta como para desanimar al posible lector.</p>
        <p align="justify">Recuerda que el t&iacute;tulo que le pones a tu p&aacute;gina es por
        lo que se la conocer&aacute; por el mundo. Es lo que guarda el navegador
        en su &iacute;ndice de marcadores, favoritos o <i>bookmarks</i>. Por
        ello, es conveniente que sea significativo y pueda ser entendido fuera
        de contexto.</p>
        <p align="justify">Conviene que el primero p&aacute;rrafo o las primeras frases de todas
        las p&aacute;ginas contengan un resumen o idea del contenido del resto
        de la misma. Eso ayuda al usuario a localizar m&aacute;s f&aacute;cilmente
        la informaci&oacute;n.</p>
        <p align="justify">A su vez, resulta bastante &uacute;til indicar la fecha de la &uacute;ltima
        modificaci&oacute;n de la p&aacute;gina, aunque es a&uacute;n mejor si esa
        fecha hace referencia a la &uacute;ltima modificaci&oacute;n del contenido,
        que al fin y al cabo es lo que le interesa el usuario.</p>
        <p align="justify">Por &uacute;ltimo, uno de los aspectos m&aacute;s importantes de Internet
        como medio es la facilidad de comunicaci&oacute;n entre creadores y usuarios:
        facilitala incluyendo tu direcci&oacute;n de correo. Si crees que puede
        ser interesante, ayuda y anima al usuario con formularios o libros de visita.</p>
      <br><br><a name="4"></a><font size="+2" color="#005CA0">21.4. Accesibilidad</font>
        <p align="justify">Hay que tener en cuenta que, en general, no sabes con qu&eacute; navegador
        visitar&aacute;n tus p&aacute;ginas. Ni c&oacute;mo estar&aacute; configurado.
        Ni la resoluci&oacute;n del monitor. Ni la potencia de su CPU. Ni siquiera si
        el navegador es capaz de ver gr&aacute;ficos. Y como se supone que la red es
        algo de lo que debe poder disfrutar todo el mundo conviene hacerla accesible.</p>
        <p align="justify">Para ello hay que tener en cuenta algunas cosas. Para empezar, que las
        p&aacute;ginas siempre se ven distintas dependiendo del navegador que usemos.
        Conviene no usar elementos que s&oacute;lo funcionen con un navegador, como
        puede ser el texto parpadeante o las marquesinas. Y siempre ser&aacute; bueno
        probar con m&aacute;s de un navegador las p&aacute;ginas: no siempre representan
        igual las mismas etiquetas.</p>
        <p align="justify">Hay gente que viaja por la red con navegadores en modo texto o que,
        debido a la lentitud de su conexi&oacute;n, configuran su navegador para
        que no cargue los gr&aacute;ficos. Por ello, conviene a&ntilde;adir siempre
        el par&aacute;metro <tt><font color="#006600" face="monospace">ALT</font></tt> a todas nuestras im&aacute;genes.
        Tambi&eacute;n, y por la misma causa, conviene dar una alternativa en texto
        de nuestros mapas.</p>
        <p align="justify">Es aconsejable probar nuestras p&aacute;ginas a la resoluci&oacute;n
        m&iacute;nima de 640x480 y comprobar que se puede ver y navegar con
        relativa comodidad. Es desgraciadamente frecuente ver marcos &iacute;ndice
        dise&ntilde;ados para verse a 800x600 y que impiden cambiarlos de tama&ntilde;o
        y se han eliminado las barras de desplazamiento.</p>
        <p align="justify">Es convieniente no abusar de los applets Java ni hacer de ellos
        un elemento imprescindible en nuestra web. A gente con pocos recursos en potencia
        de CPU o usuarios de Windows 3.1 no les resulta muy agradable estas aplicaciones.</p>
        <p align="justify">En definitiva, no hacerles la vida imposible a los minusv&aacute;lidos de
        la red. Eliminar barreras arquitect&oacute;nicas.</p>
      <br><br><a name="5"></a><font size="+2" color="#005CA0">21.5. Dise&ntilde;o</font>
        <p align="justify">Una p&aacute;gina atractiva, con gr&aacute;ficos bonitos y bien escogidos
        y colocados es algo siempre recomendable. Pero no si, debido a ello, la
        p&aacute;gina tarda dos d&iacute;as y medio en terminar de cargarse. Hay que
        tener en cuenta que estamos trabajando en un medio llamado Internet que,
        aunque denominado autopista de la informaci&oacute;n, en realidad suele
        parecerse m&aacute;s bien a una carretera comarcal. As&iacute; pues, a
        la hora de dise&ntilde;ar nuestras p&aacute;ginas, deberemos cuidar el
        equilibrio entre belleza gr&aacute;fica y tiempo de carga.</p>
        <p align="justify">Recuerda que el gr&aacute;fico de fondo no debe dificultar la lectura
        del texto. Si utilizamos uno oscuro que el color del texto sea claro y
        viceversa.</p>
        <p align="justify">Los gr&aacute;ficos animados, en general, resultan muy entretenidos
        para el autor pero poco &uacute;tiles para el usuario. No deber&iacute;an
        usarse m&aacute;s que para cosas sobre las que realmente quieres llamar
        la atenci&oacute;n (como el uso del texto parpadeante). Si no es as&iacute;,
        procura que su tama&ntilde;o no sea excesivo.</p>
        <p align="justify">Mientras puedas, evita los gr&aacute;ficos meramente ornamentales.
        Que tengan algo de utilidad, sea como t&iacute;tulo o enlace o lo que sea.
        Luego procura que, adem&aacute;s, sean bonitos.</p>
        <p align="justify">Procura evitar el exceso de l&iacute;neas horizontales: dan la
        sensaci&oacute;n de una p&aacute;gina inconexa y troceada.</p>
        <p align="justify">Evita la proliferaci&oacute;n de marcos. Si pones muchos es posible que
        el usuario se pierda y no sepa en cu&aacute;l est&aacute; cada cosa.
        Recuerda que s&oacute;lo puede haber uno con informaci&oacute;n y todos
        los dem&aacute;s deben ser auxiliares de este. El marco principal debe
        destacar sobre los otros por su mayor tama&ntilde;o.</p>
      <br><br><a name="6"></a><font size="+2" color="#005CA0">21.6. Mantenimiento y pruebas</font>
        <p align="justify">Resulta conveniente que el c&oacute;digo sea claro y f&aacute;cilmente
        comprensible: as&iacute; evitas los problemas de no entender c&oacute;mo
        hiciste una p&aacute;gina en un momento dado, o de no encontrar esa
        parte que tienes que modificar entre tanto texto.</p>
        <p align="justify">Resulta conveniente que otras personas prueben tus p&aacute;ginas.
        Y que cuando las prueben ya est&aacute;n en la red, aunque no sean accesibles
        m&aacute;s que para los probadores. Hay que cuidar que estos no conozcan
        previamente las p&aacute;ginas ni hayan tenido que ver con su desarrollo.</p>
        <p align="justify">Y esto es todo. Que ustedes disfruten creando p&aacute;ginas. &iexcl;Hasta
        otra!</p>
      <p></p><img src="graficos/linea.gif" height="1" width="590"><table cellspacing="0" cellpadding="0" border="0" width="100%"><tr><td><img src="graficos/transp.gif" height="2" width="90"></td></tr></table><table cellspacing="0" cellpadding="0" border="0" width="100%"><tr><td align="left"><a href="sonido.html"><img src="graficos/izq.gif" align="MIDDLE" border="0"></a><font size="-1" face="Arial,Helvetica,sans-serif">Sonido</font></td><td align="right"><font size="-1" face="Arial,Helvetica,sans-serif">Enlaces a otras p&aacute;ginas</font><a href="otros.html"><img src="graficos/der.gif" align="MIDDLE" border="0"></a></td></tr></table><font size="-1"><div align="center">&copy; 1998-2000 <a href="mailto:multivac@idecnet.com">Daniel
    Rodr&iacute;guez</a><br><a href="index.html"><img src="graficos/loguito.gif" border="0"></a></div></font></font></td></tr></table></body></html>
