<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Introducci&oacute;n</TITLE>
   <META NAME="GENERATOR" CONTENT="Mozilla/3.0Gold (Win95; I) [Netscape]">
</HEAD>
<BODY TEXT="#000078" BGCOLOR="#FFFFF0" LINK="#0000FF" VLINK="#4C83FF" ALINK="#000000" BACKGROUND="paper12.gif">

<CENTER><P><IMG SRC="barra43.gif" HEIGHT=4 WIDTH=548></P></CENTER>

<CENTER><P> </P></CENTER>

<H2 ALIGN=CENTER>Introducci&oacute;n</H2>

<CENTER><P><IMG SRC="barra43.gif" HEIGHT=4 WIDTH=548></P></CENTER>

<CENTER><P> </P></CENTER>

<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;HTML es un lenguaje sencillo pensado para
presentar informaci&oacute;n en la WWW. HTML <I>(HyperText Markup Languaje)</I>,
como su nombre indica es un lenguaje de marcas para la creaci&oacute;n
de hipertextos. Por hipertexto entenderemos texto con una presentaci&oacute;n
agradable, con inclusi&oacute;n de elementos multimedia (gr&aacute;ficos,
video, audio) y con la presencia de hiperenlaces que permiten relacionar
otras fuentes de informaci&oacute;n en documentos hipertextos. Es el lenguaje
utilizado para representar documentos en la WWW (<I>World Wide Web</I>).
</P>

<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Como se ha dicho es un lenguaje de marcas
ya que en el las instrucciones son trozos de texto resaltados convenientemente
que definir&aacute;n la estructura l&oacute;gica del documento. Por tanto
un documento HTML constrar&aacute; de texto que ser&aacute; el contenido
y la informaci&oacute;n del documento y de instrucciones HTML que resaltar&aacute;n
este contenido y le dar&aacute;n un formato facil y agradable de leer y
con la posiblidad de relacionar documentos y fuentes de informaci&oacute;n
mediante hiperenlaces. </P>

<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Las marcas del lenguaje HTML especifican:
</P>

<UL type=disk>
<LI>La estructura l&oacute;gica del documento: </LI>

<UL type=disk>
<LI>Cabeceras, tipos y tama&ntilde;os de las fuentes. </LI>

<LI>Parrafos de texto. </LI>

<LI>Centrado. </LI>

<LI>Enumeraciones o listas. </LI>

<LI>Formularios. </LI>

<LI>Tablas. </LI>
</UL>

<LI>Distintos estilos que definen el texto: </LI>

<UL type=disk>
<LI>Negrita. </LI>

<LI>Cursiva. </LI>

<LI>Diferentes efectos: (direcciones de correo, citas textuales, etc…).
</LI>
</UL>

<LI>Inclusi&oacute;n de hipertextos para acceder a otros documentos relacionados
</LI>

<LI>Inclusi&oacute;n de im&aacute;genes y ficheros multimedia. </LI>
</UL>

<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El lenguaje HTML actualmente est&aacute;
en su versi&oacute;n 2.0, aunque se encuentra en desarrollo la 3.0. En
este est&aacute;ndar se definen las etiquetas b&aacute;sicas y las estructuras
de datos que forman el lenguaje. En este manual explicaremos todas las
estructuras definidas en la especificaci&oacute;n 2.0 a&ntilde;adiendo
las extensiones incluidas por <B>NetScape</B> en su <B>versi&oacute;n 2.0</B>.
La uni&oacute;n de ambos constituye la especificaci&oacute;n del lenguaje
HTML m&aacute;s extendida en la actualidad. </P>

<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Este manual tiene la voluntad de ser din&aacute;mico
y por tanto ir&aacute; incorporando las nuevas especificaciones del lenguaje
HTML que se vayan introduciendo. </P>

<CENTER><P><IMG SRC="barra10.gif" HEIGHT=1 WIDTH=585> </P></CENTER>

<CENTER><P><A HREF="indice.htm"><IMG SRC="manual5_1.gif" BORDER=0 HEIGHT=40 WIDTH=183 ALIGN=ABSCENTER></A>
<A HREF="indice.htm"><IMG SRC="indice.gif" HSPACE=5 BORDER=0 HEIGHT=30 WIDTH=30 ALIGN=ABSCENTER></A><A HREF="indice.htm">Indice</A>
<A HREF="etiquet.htm"><IMG SRC="siguiente.gif" HSPACE=5 BORDER=0 HEIGHT=30 WIDTH=30 ALIGN=ABSCENTER></A><A HREF="etiquet.htm">Siguiente</A>
</P></CENTER>

</BODY>
</HTML>
